driver-tests/sqlse/sqlserver/Sqlse1172_SQL/InsertOneParamFullQualJbi/test/Sqlse1172_SQL/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sql="http://com.sun.jbi/sqlse/sqlseengine">
  <soapenv:Body>
    <sql:InsertOneParamFullQualRequest>
      <sql:param1>789</sql:param1>
      <sql:param2>Pavan</sql:param2>
      <sql:param3>1</sql:param3>
      <sql:param4>Bangalore</sql:param4>
      <sql:param5>6000</sql:param5>
    </sql:InsertOneParamFullQualRequest>
  </soapenv:Body>
</soapenv:Envelope>